#include <stdio.h>
#include <windows.h>

//写一个宏，将一个数的二进制位的奇数位和偶数位交换
//15 
//00000000 00000000 00000000 00001111
//00000000 00000000 00000000 00000101   奇数位 -->（左移1位） 00000000 00000000 00000000 00001010
//00000000 00000000 00000000 00001010   偶数位 -->（右移1位） 00000000 00000000 00000000 00000101
//相加即得到奇偶位交换后的数
//(NUM&0xaaaaaaaa)>>1 得到偶数位并右移1位
//(NUM&0x55555555)<<1 得到奇数位并左移1位

#define SWAP(NUM) (  (  (NUM&0xaaaaaaaa)>>1  ) + (  (NUM&0x55555555)<<1  )  )

int main()
{
    int num=0;
    scanf("%d",&num);
    printf("%d\n",SWAP(num));
    system("pause");
    return 0;
}